GopalSaraf/Practicals/PSDL/include/legacy/pic12f617_legacy.h

#ifndef	_HTC_H_
#warning Header file pic12f617.h included directly. Use #include <htc.h> instead.
#endif

/* header file for the MICROCHIP PIC microcontroller
 *  12F617
 */


#ifndef __PIC12F617_H
#define __PIC12F617_H

// Config Register: CONFIG
#define CONFIG               0x2007

//
// Special function register definitions
//


// Register: INDF
volatile unsigned char           INDF                __at(0x000);
// __bit and bitfield definitions

// Register: TMR0
volatile unsigned char           TMR0                __at(0x001);
// __bit and bitfield definitions

// Register: PCL
volatile unsigned char           PCL                 __at(0x002);
// __bit and bitfield definitions

// Register: STATUS
volatile unsigned char           STATUS              __at(0x003);
// __bit and bitfield definitions
volatile __bit CARRY               __at((0x003*8)+0);
volatile __bit DC                  __at((0x003*8)+1);
volatile __bit ZERO                __at((0x003*8)+2);
volatile __bit nPD                 __at((0x003*8)+3);
volatile __bit nTO                 __at((0x003*8)+4);
volatile __bit IRP                 __at((0x003*8)+7);
volatile __bit RP0                 __at((0x003*8)+5);
volatile __bit RP1                 __at((0x003*8)+6);
#ifndef _LIB_BUILD
volatile union {
    struct {
        unsigned	C                   : 1;
        unsigned	DC                  : 1;
        unsigned	Z                   : 1;
        unsigned	nPD                 : 1;
        unsigned	nTO                 : 1;
        unsigned	RP                  : 2;
        unsigned	IRP                 : 1;
    };
    struct {
        unsigned	                    : 5;
        unsigned	RP0                 : 1;
        unsigned	RP1                 : 1;
    };
} STATUSbits __at(0x003);
#endif

// Register: FSR
volatile unsigned char           FSR                 __at(0x004);
// __bit and bitfield definitions

// Register: GPIO
volatile unsigned char           GPIO                __at(0x005);
volatile unsigned char           PORTA               __at(0x005);
// __bit and bitfield definitions
volatile __bit GP0                 __at((0x005*8)+0);
volatile __bit GP1                 __at((0x005*8)+1);
volatile __bit GP2                 __at((0x005*8)+2);
volatile __bit GP3                 __at((0x005*8)+3);
volatile __bit GP4                 __at((0x005*8)+4);
volatile __bit GP5                 __at((0x005*8)+5);
volatile __bit GPIO0               __at((0x005*8)+0);
volatile __bit GPIO1               __at((0x005*8)+1);
volatile __bit GPIO2               __at((0x005*8)+2);
volatile __bit GPIO3               __at((0x005*8)+3);
volatile __bit GPIO4               __at((0x005*8)+4);
volatile __bit GPIO5               __at((0x005*8)+5);
volatile __bit RA0                 __at((0x005*8)+0);
volatile __bit RA1                 __at((0x005*8)+1);
volatile __bit RA2                 __at((0x005*8)+2);
volatile __bit RA3                 __at((0x005*8)+3);
volatile __bit RA4                 __at((0x005*8)+4);
volatile __bit RA5                 __at((0x005*8)+5);
#ifndef _LIB_BUILD
volatile union {
    struct {
        unsigned	GP0                 : 1;
        unsigned	GP1                 : 1;
        unsigned	GP2                 : 1;
        unsigned	GP3                 : 1;
        unsigned	GP4                 : 1;
        unsigned	GP5                 : 1;
    };
    struct {
        unsigned	GPIO0               : 1;
        unsigned	GPIO1               : 1;
        unsigned	GPIO2               : 1;
        unsigned	GPIO3               : 1;
        unsigned	GPIO4               : 1;
        unsigned	GPIO5               : 1;
    };
    struct {
        unsigned	RA0                 : 1;
        unsigned	RA1                 : 1;
        unsigned	RA2                 : 1;
        unsigned	RA3                 : 1;
        unsigned	RA4                 : 1;
        unsigned	RA5                 : 1;
    };
} GPIObits __at(0x005);
#endif

// Register: PCLATH
volatile unsigned char           PCLATH              __at(0x00A);
// __bit and bitfield definitions
#ifndef _LIB_BUILD
volatile union {
    struct {
        unsigned	                    : 5;
    };
} PCLATHbits __at(0x00A);
#endif

// Register: INTCON
volatile unsigned char           INTCON              __at(0x00B);
// __bit and bitfield definitions
volatile __bit GPIF                __at((0x00B*8)+0);
volatile __bit INTF                __at((0x00B*8)+1);
volatile __bit T0IF                __at((0x00B*8)+2);
volatile __bit GPIE                __at((0x00B*8)+3);
volatile __bit INTE                __at((0x00B*8)+4);
volatile __bit T0IE                __at((0x00B*8)+5);
volatile __bit PEIE                __at((0x00B*8)+6);
volatile __bit GIE                 __at((0x00B*8)+7);
volatile __bit TMR0IF              __at((0x00B*8)+2);
volatile __bit TMR0IE              __at((0x00B*8)+5);
#ifndef _LIB_BUILD
volatile union {
    struct {
        unsigned	GPIF                : 1;
        unsigned	INTF                : 1;
        unsigned	T0IF                : 1;
        unsigned	GPIE                : 1;
        unsigned	INTE                : 1;
        unsigned	T0IE                : 1;
        unsigned	PEIE                : 1;
        unsigned	GIE                 : 1;
    };
    struct {
        unsigned	                    : 2;
        unsigned	TMR0IF              : 1;
        unsigned	: 2;
        unsigned	TMR0IE              : 1;
    };
} INTCONbits __at(0x00B);
#endif

// Register: PIR1
volatile unsigned char           PIR1                __at(0x00C);
// __bit and bitfield definitions
volatile __bit TMR1IF              __at((0x00C*8)+0);
volatile __bit TMR2IF              __at((0x00C*8)+1);
volatile __bit CMIF                __at((0x00C*8)+3);
volatile __bit CCP1IF              __at((0x00C*8)+5);
volatile __bit ADIF                __at((0x00C*8)+6);
volatile __bit C1IF                __at((0x00C*8)+3);
volatile __bit CCPIF               __at((0x00C*8)+5);
volatile __bit ECCPIF              __at((0x00C*8)+5);
#ifndef _LIB_BUILD
volatile union {
    struct {
        unsigned	TMR1IF              : 1;
        unsigned	TMR2IF              : 1;
        unsigned	                    : 1;
        unsigned	CMIF                : 1;
        unsigned	: 1;
        unsigned	CCP1IF              : 1;
        unsigned	ADIF                : 1;
    };
    struct {
        unsigned	: 3;
        unsigned	C1IF                : 1;
        unsigned	: 1;
        unsigned	CCPIF               : 1;
    };
    struct {
        unsigned	: 5;
        unsigned	ECCPIF              : 1;
    };
} PIR1bits __at(0x00C);
#endif
// __bit and bitfield definitions

// Register: TMR1L
volatile unsigned char           TMR1L               __at(0x00E);
// __bit and bitfield definitions

// Register: TMR1H
volatile unsigned char           TMR1H               __at(0x00F);
// __bit and bitfield definitions

// Register: TMR1
volatile unsigned int            TMR1                __at(0x00E);

