GopalSaraf/Practicals/PSDL/include/legacy/pic12f617_legacy.h
// Register: OSCTUNE
volatile unsigned char           OSCTUNE             __at(0x090);
// __bit and bitfield definitions
volatile __bit TUN0                __at((0x090*8)+0);
volatile __bit TUN1                __at((0x090*8)+1);
volatile __bit TUN2                __at((0x090*8)+2);
volatile __bit TUN3                __at((0x090*8)+3);
volatile __bit TUN4                __at((0x090*8)+4);
#ifndef _LIB_BUILD
volatile union {
    struct {
        unsigned	TUN                 : 5;
    };
    struct {
        unsigned	TUN0                : 1;
        unsigned	TUN1                : 1;
        unsigned	TUN2                : 1;
        unsigned	TUN3                : 1;
        unsigned	TUN4                : 1;
    };
} OSCTUNEbits __at(0x090);
#endif

// Register: PR2
volatile unsigned char           PR2                 __at(0x092);
// __bit and bitfield definitions

// Register: APFCON
volatile unsigned char           APFCON              __at(0x093);
// __bit and bitfield definitions
volatile __bit P1ASEL              __at((0x093*8)+0);
volatile __bit P1BSEL              __at((0x093*8)+1);
volatile __bit T1GSEL              __at((0x093*8)+4);
#ifndef _LIB_BUILD
volatile union {
    struct {
        unsigned	P1ASEL              : 1;
        unsigned	P1BSEL              : 1;
        unsigned	                    : 2;
        unsigned	T1GSEL              : 1;
    };
} APFCONbits __at(0x093);
#endif

// Register: WPU
volatile unsigned char           WPU                 __at(0x095);
volatile unsigned char           WPUA                __at(0x095);
// __bit and bitfield definitions
volatile __bit WPU0                __at((0x095*8)+0);
volatile __bit WPU1                __at((0x095*8)+1);
volatile __bit WPU2                __at((0x095*8)+2);
volatile __bit WPU4                __at((0x095*8)+4);
volatile __bit WPU5                __at((0x095*8)+5);
volatile __bit WPUA0               __at((0x095*8)+0);
volatile __bit WPUA1               __at((0x095*8)+1);
volatile __bit WPUA2               __at((0x095*8)+2);
volatile __bit WPUA4               __at((0x095*8)+4);
volatile __bit WPUA5               __at((0x095*8)+5);
#ifndef _LIB_BUILD
volatile union {
    struct {
        unsigned	WPU0                : 1;
        unsigned	WPU1                : 1;
        unsigned	WPU2                : 1;
        unsigned	                    : 1;
        unsigned	WPU4                : 1;
        unsigned	WPU5                : 1;
    };
    struct {
        unsigned	WPUA0               : 1;
        unsigned	WPUA1               : 1;
        unsigned	WPUA2               : 1;
        unsigned	: 1;
        unsigned	WPUA4               : 1;
        unsigned	WPUA5               : 1;
    };
} WPUbits __at(0x095);
#endif

// Register: IOC
volatile unsigned char           IOC                 __at(0x096);
volatile unsigned char           IOCA                __at(0x096);
// __bit and bitfield definitions
volatile __bit IOC0                __at((0x096*8)+0);
volatile __bit IOC1                __at((0x096*8)+1);
volatile __bit IOC2                __at((0x096*8)+2);
volatile __bit IOC3                __at((0x096*8)+3);
volatile __bit IOC4                __at((0x096*8)+4);
volatile __bit IOC5                __at((0x096*8)+5);
volatile __bit IOCA0               __at((0x096*8)+0);
volatile __bit IOCA1               __at((0x096*8)+1);
volatile __bit IOCA2               __at((0x096*8)+2);
volatile __bit IOCA3               __at((0x096*8)+3);
volatile __bit IOCA4               __at((0x096*8)+4);
volatile __bit IOCA5               __at((0x096*8)+5);
#ifndef _LIB_BUILD
volatile union {
    struct {
        unsigned	IOC0                : 1;
        unsigned	IOC1                : 1;
        unsigned	IOC2                : 1;
        unsigned	IOC3                : 1;
        unsigned	IOC4                : 1;
        unsigned	IOC5                : 1;
    };
    struct {
        unsigned	IOCA0               : 1;
        unsigned	IOCA1               : 1;
        unsigned	IOCA2               : 1;
        unsigned	IOCA3               : 1;
        unsigned	IOCA4               : 1;
        unsigned	IOCA5               : 1;
    };
} IOCbits __at(0x096);
#endif

// Register: PMCON1
volatile unsigned char           PMCON1              __at(0x098);
// __bit and bitfield definitions
volatile __bit RD                  __at((0x098*8)+0);
volatile __bit WR                  __at((0x098*8)+1);
volatile __bit WREN                __at((0x098*8)+2);
#ifndef _LIB_BUILD
volatile union {
    struct {
        unsigned	RD                  : 1;
        unsigned	WR                  : 1;
        unsigned	WREN                : 1;
    };
} PMCON1bits __at(0x098);
#endif

// Register: PMCON2
volatile unsigned char           PMCON2              __at(0x099);
// __bit and bitfield definitions

// Register: PMADRL
volatile unsigned char           PMADRL              __at(0x09A);
// __bit and bitfield definitions
volatile __bit PMADRL0             __at((0x09A*8)+0);
volatile __bit PMADRL1             __at((0x09A*8)+1);
volatile __bit PMADRL2             __at((0x09A*8)+2);
volatile __bit PMADRL3             __at((0x09A*8)+3);
volatile __bit PMADRL4             __at((0x09A*8)+4);
volatile __bit PMADRL5             __at((0x09A*8)+5);
volatile __bit PMADRL6             __at((0x09A*8)+6);
volatile __bit PMADRL7             __at((0x09A*8)+7);
#ifndef _LIB_BUILD
volatile union {
    struct {
        unsigned	PMADRL0             : 1;
        unsigned	PMADRL1             : 1;
        unsigned	PMADRL2             : 1;
        unsigned	PMADRL3             : 1;
        unsigned	PMADRL4             : 1;
        unsigned	PMADRL5             : 1;
        unsigned	PMADRL6             : 1;
        unsigned	PMADRL7             : 1;
    };
} PMADRLbits __at(0x09A);
#endif

// Register: PMADRH
volatile unsigned char           PMADRH              __at(0x09B);
// __bit and bitfield definitions
volatile __bit PMADRH0             __at((0x09B*8)+0);
volatile __bit PMADRH1             __at((0x09B*8)+1);
volatile __bit PMADRH2             __at((0x09B*8)+2);
#ifndef _LIB_BUILD
volatile union {
    struct {
        unsigned	PMADRH0             : 1;
        unsigned	PMADRH1             : 1;
        unsigned	PMADRH2             : 1;
    };
} PMADRHbits __at(0x09B);
#endif

// Register: PMDATL
volatile unsigned char           PMDATL              __at(0x09C);
// __bit and bitfield definitions
volatile __bit PMDATL0             __at((0x09C*8)+0);
volatile __bit PMDATL1             __at((0x09C*8)+1);
volatile __bit PMDATL2             __at((0x09C*8)+2);
volatile __bit PMDATL3             __at((0x09C*8)+3);
volatile __bit PMDATL4             __at((0x09C*8)+4);
volatile __bit PMDATL5             __at((0x09C*8)+5);
volatile __bit PMDATL6             __at((0x09C*8)+6);
volatile __bit PMDATL7             __at((0x09C*8)+7);
#ifndef _LIB_BUILD
volatile union {
    struct {
        unsigned	PMDATL0             : 1;
        unsigned	PMDATL1             : 1;
        unsigned	PMDATL2             : 1;
        unsigned	PMDATL3             : 1;
        unsigned	PMDATL4             : 1;
        unsigned	PMDATL5             : 1;
        unsigned	PMDATL6             : 1;
        unsigned	PMDATL7             : 1;
    };
} PMDATLbits __at(0x09C);
#endif

// Register: PMDATH
volatile unsigned char           PMDATH              __at(0x09D);
// __bit and bitfield definitions
#ifndef _LIB_BUILD
volatile union {
    struct {
        unsigned	PMDATH              : 6;
    };
} PMDATHbits __at(0x09D);
#endif

// Register: ADRESL
volatile unsigned char           ADRESL              __at(0x09E);
// __bit and bitfield definitions

// Register: ANSEL
volatile unsigned char           ANSEL               __at(0x09F);
// __bit and bitfield definitions
volatile __bit ANS0                __at((0x09F*8)+0);
volatile __bit ANS1                __at((0x09F*8)+1);
volatile __bit ANS2                __at((0x09F*8)+2);
volatile __bit ANS3                __at((0x09F*8)+3);
volatile __bit ADCS0               __at((0x09F*8)+4);
volatile __bit ADCS1               __at((0x09F*8)+5);
volatile __bit ADCS2               __at((0x09F*8)+6);
#ifndef _LIB_BUILD
volatile union {
    struct {
        unsigned	ANS                 : 4;
        unsigned	ADCS                : 3;
    };
    struct {
        unsigned	ANS0                : 1;
        unsigned	ANS1                : 1;
        unsigned	ANS2                : 1;
        unsigned	ANS3                : 1;
        unsigned	ADCS0               : 1;
        unsigned	ADCS1               : 1;
        unsigned	ADCS2               : 1;
    };
} ANSELbits __at(0x09F);
#endif

#endif
